KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
/*
 * STM32_SX1278.c
 *
 *  Created on: Jan 22, 2018
 *      Author: kien
 */


/*!_____
 / _____)             _              | |
( (____  _____ ____ _| |_ _____  ____| |__
 \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 _____) ) ____| | | || |_| ____( (___| | | |
(______/|_____)_|_|_| \__)_____)\____)_| |_|
    (C)2013 Semtech
 ___    _    _____  ___  _      _    _
/ __|  /_\  |  _  \/ __|| |    /_\  | |_
\__ \ / _ \ | | | |\__ \| |_  / _ \ | _ \
|___//_/ \_\|_| |_||___/|___)/_/ \_\|__ /

	******************************************************************************
  * @file    STM32_SX1278.c
  * @author  Dao Duc Anh
  * @version V1.0.0
  * @date    8/5/2017
  * @brief   SX1278 module driver.
  *          This is the common part of the SX1278 initialization
  *
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    This program designed by sanslab engineer. It base on the opensource api
		from cooking hack
		Link: http://www.cooking-hacks.com/media/cooking/images/documentation/tutorial_SX1272/SX1272_library_arduino_v1.4.zip

		This program is distributed in the hope that it will be useful  for anyone want
		to work with the LoRa chip from semtech like SX1278.


  @endverbatim
  ******************************************************************************
 */


#include "STM32_SX1278.h"

// LPD433 (low power device 433 MHz) is a part of ITU region 1 ISM band
/*!
	From 433.050 MHz to 434.790 MHz: BW: 1.74 MHz
	More info: https://en.wikipedia.org/wiki/LPD433
 */

#define  CH_DEFAULT  0x6c8000 // default channel, center frequency = 434.000MHz

// FREQUENCY CHANNELS (BANDWIDTH 500KHz):
#define CH_1_BW_500  0x6c5345 // channel 1, bandwidth 500KHz, center frequency = 433.3MHz ( 433.050MHz - 433.550MHz )
#define CH_2_BW_500  0x6c7af3 // channel 2, bandwidth 500KHz, center frequency = 433.92MHz ( 433.670MHz - 433.920MHz )
#define CH_3_BW_500  0x6ca2a1 // channel 3, bandwidth 500KHz, center frequency = 434.54MHz ( 434.290MHz - 434.790MHz )

// FREQUENCY CHANNELS (BANDWIDTH 250KHz):
#define CH_1_BW_250 0x6c4b45 // channel 1, bandwidth 250KHz, center frequency = 433.175MHz ( 433.050MHz - 433.300MHz )
#define CH_2_BW_250 0x6c5e57 // channel 2, bandwidth 250KHz, center frequency = 433.473MHz ( 433.348MHz - 433.598MHz )
#define CH_3_BW_250 0x6c716a// channel 3, bandwidth 250KHz, center frequency = 433.771MHz ( 433.646MHz - 433.896MHz )
#define CH_4_BW_250 0x6c847c // channel 4, bandwidth 250KHz, center frequency = 434.069MHz ( 433.944MHz - 434.194MHz )
#define	CH_5_BW_250 0x6c978f // channel 5, bandwidth 250KHz, center frequency = 434.367MHz ( 434.242MHz - 434.492MHz )
#define CH_6_BW_250 0x6caaa1 // channel 6, bandwidth 250KHz, center frequency = 434.665MHz ( 434.540MHz - 434.790MHz )

// FREQUENCY CHANNELS (BANDWIDTH 125KHz):
#define CH_1_BW_125  0x6c4745 // channel 1, bandwidth 125KHz, center frequency = 433.1125MHz ( 433.050MHz - 433.175MHz )
#define CH_2_BW_125  0x6c4fe1 // channel 2, bandwidth 125KHz, center frequency = 433.247MHz ( 433.1845MHz - 433.3095MHz )
#define CH_3_BW_125  0x6c587c // channel 3, bandwidth 125KHz, center frequency = 433.3815MHz ( 433.319MHz - 433.444MHz )
#define CH_4_BW_125  0x6c6118 // channel 4, bandwidth 125KHz, center frequency = 433.516MHz ( 433.4535MHz - 433.5785MHz )
#define CH_5_BW_125  0x6c69b3 // channel 5, bandwidth 125KHz, center frequency = 433.6505MHz ( 433.588MHz - 433.713MHz )
#define CH_6_BW_125  0x6c724f // channel 6, bandwidth 125KHz, center frequency = 433.785MHz ( 433.7225MHz - 433.8475MHz )
#define CH_7_BW_125  0x6c7af3// channel 7, bandwidth 125KHz, center frequency = 433.92MHz ( 433.8575MHz - 433.9825MHz )
#define CH_8_BW_125  0x6c8397 // channel 8, bandwidth 125KHz, center frequency = 434.055MHz ( 433.9925MHz - 434.1175MHz )
#define CH_9_BW_125  0x6c8c32 // channel 9, bandwidth 125KHz, center frequency = 434.1895MHz ( 434.127MHz - 434.252MHz )
#define CH_10_BW_125  0x6c94ce // channel 10, bandwidth 125KHz, center frequency = 434.324MHz ( 434.2615MHz - 434.3865MHz )
#define CH_11_BW_125  0x6c9d6a // channel 11, bandwidth 125KHz, center frequency = 434.4585MHz ( 434.396MHz - 434.521MHz )
#define CH_12_BW_125  0x6ca605 // channel 12, bandwidth 125KHz, center frequency = 434.593MHz ( 434.5305MHz - 434.6555MHz )
#define CH_13_BW_125  0x6CaeA1 // channel 13, bandwidth 125KHz, center frequency = 434.7275MHz ( 434.665MHz - 434.790MHz )

// FREQUENCY CHANNELS (BANDWIDTH < 125KHz: separate 72.5KHz):
#define CH_1  0x6c4597 // channel 1, center freq = 433.086MHz
#define CH_2  0x6c4a3b // channel 2, center freq = 433.159MHz
#define CH_3  0x6c4edf // channel 3, center freq = 433.231MHz
#define CH_4  0x6c5383 // channel 4, center freq = 433.304MHz
#define CH_5  0x6c5827 // channel 5, center freq = 433.376MHz
#define CH_6  0x6c5ccb// channel 6, center freq = 433.449MHz
#define CH_7  0x6c616f // channel 7, center freq = 433.521MHz
#define CH_8  0x6c6613// channel 8, center freq = 433.594MHz
#define CH_9  0x6c6ab7 // channel 9, center freq = 433.666MHz
#define CH_10  0x6c6f5b // channel 10, center freq = 433.739MHz
#define CH_11  0x6c73ff // channel 11, center freq = 433.811MHz
#define CH_12  0x6c78a3 // channel 12, center freq = 433.884MHz
#define CH_13  0x6c7d47 // channel 13, center freq = 433.956MHz
#define CH_14  0x6c81eb // channel 14, center freq = 434.029MHz
#define CH_15  0x6c868f // channel 15, center freq = 434.101MHz
#define CH_16  0x6c8b33 // channel 16, center freq = 434.174MHz
#define CH_17  0x6c8fd8 // channel 17, center freq = 434.246MHz
#define CH_18  0x6c947c // channel 18, center freq = 434.319MHz
#define CH_19  0x6c9920 // channel 19, center freq = 434.391MHz
#define CH_20  0x6c9dc4 // channel 20, center freq = 434.464MHz
#define CH_21  0x6ca268 // channel 21, center freq = 434.536MHz
#define CH_22  0x6ca70c // channel 22, center freq = 434.609MHz
#define CH_23  0x6cabb0 // channel 23, center freq = 434.682MHz
#define CH_24  0x6cb054 // channel 24, center freq = 434.754MHz

//LORA BANDWIDTH:
#define  BW_7_8  0x00
#define  BW_10_4  0x01
#define  BW_15_6  0x02
#define  BW_20_8  0x03
#define  BW_31_2  0x04
#define  BW_41_7  0x05
#define  BW_62_5  0x06
#define  BW_125  0x07
#define  BW_250  0x08
#define  BW_500  0x09

