KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
_Bool check;

/// Variables /////////////////////////////////////////////////////////////

	//! Variable : SD state.
	//!    st_SD = 00  --> SD_OFF
	//!    st_SD = 01  --> SD_ON
	uint8_t st_SD;

	//! Variable : bandwidth configured in LoRa mode.
	//!    bandwidth = 0000  --> BW = 7.8KHz
	//!    bandwidth = 0001  --> BW = 10.4KHz
	//!    bandwidth = 0010  --> BW = 15.6KHz
	//!    bandwidth = 0011  --> BW = 20.8KHz
	//!    bandwidth = 0100  --> BW = 31.2KHz
	//!    bandwidth = 0101  --> BW = 41.7KHz
	//!    bandwidth = 0110  --> BW = 62.5KHz
	//!    bandwidth = 0111  --> BW = 125KHz
	//!    bandwidth = 1000  --> BW = 250KHz
	//!    bandwidth = 1001  --> BW = 500KHz
	uint8_t _bandwidth;

	//! Variable : coding rate configured in LoRa mode.
	//!    codingRate = 001  --> CR = 4/5
	//!    codingRate = 010  --> CR = 4/6
	//!    codingRate = 011  --> CR = 4/7
	//!    codingRate = 100  --> CR = 4/8
	uint8_t _codingRate;

	//! Variable : spreading factor configured in LoRa mode.
	//!    spreadingFactor = 6   --> SF = 6, 64 chips/symbol
	//!    spreadingFactor = 7   --> SF = 7, 128 chips/symbol
	//!    spreadingFactor = 8   --> SF = 8, 256 chips/symbol
	//!    spreadingFactor = 9   --> SF = 9, 512 chips/symbol
	//!    spreadingFactor = 10  --> SF = 10, 1024 chips/symbol
	//!    spreadingFactor = 11  --> SF = 11, 2048 chips/symbol
	//!    spreadingFactor = 12  --> SF = 12, 4096 chips/symbol
	uint8_t _spreadingFactor;

	//! Variable : frequency channel.
	//!    channel = 0x6b0000  --> CH = 1, 428MHz
	//!    channel = 0x6b2000  --> CH = 2, 428.5MHz
	//!    channel = 0x6b4000  --> CH = 3, 429MHz
	//!    channel = 0x6b6000  --> CH = 4, 429.5MHz
	//!    channel = 0x6b8000  --> CH = 5, 430MHz
	//!    channel = 0x6ba000  --> CH = 6, 430.5MHz
	//!    channel = 0x6bc000  --> CH = 7, 431MHz
	//!    channel = 0x6be000  --> CH = 8, 431.5MHz
	//!    channel = 0x6c0000  --> CH = 9, 432MHz
	//!    channel = 0x6c2000  --> CH = 10, 432.5MHz
	//!    channel = 0x6c4000  --> CH = 11, 433MHz
	//!    channel = 0x6c6000  --> CH = 12, 433.5MHz
	//!    channel = 0x6c8000  --> CH = 13, 434MHz
	//!    channel = 0x6ca000  --> CH = 14, 434.5MHz
	//!    channel = 0x6cc000  --> CH = 15, 435MHz
	//!    channel = 0x6ce000  --> CH = 16, 435.5MHz
	//!    channel = 0x6d0000  --> CH = 17, 436MHz
	//!    channel = 0x6d2000  --> CH = 18, 436.5MHz
	//!    channel = 0x6d4000  --> CH = 19, 437MHz
	//!    channel = 0x6d6000  --> CH = 20, 437.5MHz
	//!    channel = 0x6d8000  --> CH = 21, 438MHz
	//!    channel = 0x6da000  --> CH = 22, 438.5MHz
	//!    channel = 0x6dc000  --> CH = 23, 439MHz
	//!    channel = 0x6de000  --> CH = 24, 439.5MHz
	uint32_t _channel;

	//! Variable : output power.
	//!
	uint8_t _power;

	//! Variable : SNR from the last packet received in LoRa mode.
	//!
	int8_t _SNR;

	//! Variable : RSSI current value.
	//!
	int8_t _RSSI;

	//! Variable : RSSI from the last packet received in LoRa mode.
	//!
	int16_t _RSSIpacket;

	//! Variable : preamble length sent/received.
	//!
	uint16_t _preamblelength;

	//! Variable : payload length sent/received.
	//!
	uint16_t _payloadlength;

	//! Variable : node address.
	//!
	uint8_t _nodeAddress;

	//! Variable : implicit or explicit header in LoRa mode.
	//!
	uint8_t _header = HEADER_ON;

	//! Variable : header received while waiting a packet to arrive.
	//!
	uint8_t _hreceived;

	//! Variable : presence or absence of CRC calculation.
	//!
	uint8_t _CRC;

	//! Variable : packet destination.
	//!
	uint8_t _destination;

	//! Variable : packet number.
	//!
	uint8_t _packetNumber;

	//! Variable : indicates if received packet is correct or incorrect.
  uint8_t _reception;

	//! Variable : number of current retry.
	uint8_t _retries;

  //! Variable : maximum number of retries.
	uint8_t _maxRetries;

  //! Variable : maximum current supply.
	uint8_t _maxCurrent;

	//! Variable : indicates FSK or LoRa modem.
	uint8_t _modem;

	//! Variable : temperature module.
	int _temp;

	//! Variable : current timeout to send a packet.
	uint16_t _sendTime;

	//! Variable : array with all the information about a sent/received/sent(received) ack packet.
	extern pack packet_sent, packet_received, ACK;


//************************************************************
//FUNCTION****************************************************

//BEGIN

void SX1278(void)
{
	_bandwidth = BW_125;
	_codingRate = CR_5;
	_spreadingFactor = SF_7;
	_channel = CH_1;
	_header = HEADER_ON;
	_CRC = CRC_ON;
	_modem = LORA;
	_power = 15;
	_packetNumber = 0;
	_reception = CORRECT_PACKET;
	_retries = 0;
	_maxRetries = 3;
	packet_sent.retry = _retries;
}
/*
 Function: in out data spi.
*/
uint16_t HW_SPI_InOut(SPI_HandleTypeDef *hspi, uint16_t txData )
{
  uint16_t rxData ;

  HAL_SPI_TransmitReceive( hspi, ( uint8_t * ) &txData, ( uint8_t* ) &rxData, 1, HAL_MAX_DELAY);

  return rxData;
}

void SX1272ReadBuffer(SPI_HandleTypeDef *hspi, uint8_t addr, uint8_t *buffer, uint8_t size )
{
    uint8_t i;
		HAL_GPIO_WritePin(SX1278_NSS_PORT, SX1278_NSS_PIN, GPIO_PIN_RESET);
		HW_SPI_InOut(hspi, addr & 0x7F );
		for( i = 0; i < size; i++ )
		{
			buffer[i] = HW_SPI_InOut(hspi, 0 );
		}
  	HAL_GPIO_WritePin(SX1278_NSS_PORT, SX1278_NSS_PIN, GPIO_PIN_SET);
}
/*
 Function: Reads the indicated register.
 Returns: The content of the register
 Parameters:
   address: address register to read from
*/
uint8_t readRegister(SPI_HandleTypeDef *hspi, uint8_t addr )
{
    uint8_t data;
    SX1272ReadBuffer(hspi, addr, &data, 1 );
    return data;
}

void SX1272WriteBuffer(SPI_HandleTypeDef *hspi, uint8_t addr, uint8_t *buffer, uint8_t size )
{
    uint8_t i;
    HAL_GPIO_WritePin(SX1278_NSS_PORT, SX1278_NSS_PIN, GPIO_PIN_RESET);
		HW_SPI_InOut(hspi, addr | 0x80 );
		for( i = 0; i < size; i++ )
			{
				HW_SPI_InOut(hspi, buffer[i] );
			}
    HAL_GPIO_WritePin(SX1278_NSS_PORT, SX1278_NSS_PIN, GPIO_PIN_SET);
}
/*
 Function: Writes on the indicated register.
 Returns: Nothing
 Parameters:
   address: address register to write in
   data : value to write in the register
*/
void writeRegister(SPI_HandleTypeDef *hspi, uint8_t addr, uint8_t data )
{
    SX1272WriteBuffer(hspi, addr, &data, 1 );
}
/*
 Function: It gets the theoretical value of the time-on-air of the packet
 Link: http://www.semtech.com/images/datasheet/sx1276.pdf
 Returns: Float that determines the time-on-air
*/
float timeOnAir( uint16_t payloadlength )
{
	float BW;
	float DE = 0;
	float SF = _spreadingFactor;
	float PL = payloadlength + OFFSET_PAYLOADLENGTH;
	float H = _header;
	float CR = _codingRate;

	// Dara rate optimization enabled if SF is 11 or 12
	if( SF > 10) DE = 1.0;
	else DE = 0.0;

