KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
	// payload correction
	if( payloadlength == 0 ) PL = 255;

	// Bandwidth value setting
	if( _bandwidth == BW_125 ) 		BW = 125.0;
	else if( _bandwidth == BW_250 ) BW = 250.0;
	else if( _bandwidth == BW_500 ) BW = 500.0;
	else BW = 125.0;

	// Calculation steps:
	float Tsym = pow(2,SF)/(BW); // ms
	float Tpreamble = (8+4.25)*Tsym;// ms
	float argument1 = ceil( (8.0*PL-4.0*SF+28.0+16.0-20.0*H)/(4.0*(SF-2.0*DE)) )*(CR+4.0);
	float argument2 = 0;
	float payloadSymbNb = 8 + (max( argument1, argument2));
	float Tpayload = payloadSymbNb * Tsym;
	float Tpacket = Tpreamble + Tpayload;

	return Tpacket;
}
/*
 Function: It sets a char array payload packet in a packet struct.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t setPayload(SPI_HandleTypeDef *hspi, char *payload)
{
	uint8_t state = 2;
	uint8_t state_f = 2;
	uint16_t length16;

	state = 1;
	length16 = (uint16_t)strlen(payload);
	state = truncPayload(length16);
	if( state == 0 )
	{
		// fill data field until the end of the string
		for(unsigned int i = 0; i < _payloadlength; i++)
		{
			packet_sent.data[i] = payload[i];
		}
	}
	else
	{
		state_f = state;
	}

	// In the case of FSK mode, the max payload is more restrictive
	if( ( _modem == FSK ) && ( _payloadlength > MAX_PAYLOAD_FSK ) )
	{
		_payloadlength = MAX_PAYLOAD_FSK;
		state = 1;
	}

	// Set length with the actual counter value
	// Setting packet length in packet structure
	state_f = setPacketLength_payloadlength(hspi);
	return state_f;
}
/*
 Function: If a packet is received, checks its destination.
 Returns: _Bool that's 'true' if the packet is for the module and
		  it's 'false' if the packet is not for the module.
 Parameters:
   wait: time to wait while there is no a valid header received.
*/
_Bool	availableData(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t value;
	uint8_t header = 0;
	_Bool forme = false;
	unsigned long previous;

	// update attribute
	_Bool _hreceived = false;

	previous = HAL_GetTick();
	if( _modem == LORA )
	{
		/// LoRa mode
		// read REG_IRQ_FLAGS
		value = readRegister(hspi,REG_IRQ_FLAGS);

		// Wait to ValidHeader interrupt in REG_IRQ_FLAGS
		while( (bitRead(value, 4) == 0) && (HAL_GetTick()-previous < (unsigned long)wait) )
		{
			// read REG_IRQ_FLAGS
			value = readRegister(hspi,REG_IRQ_FLAGS);

			// Condition to avoid an overflow (DO NOT REMOVE)
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}

		// Check if ValidHeader was received
		if( bitRead(value, 4) == 1 )
		{
			_hreceived = true;
			while( (header == 0) && (HAL_GetTick()-previous < (unsigned long)wait) )
			{
				// Wait for the increment of the RX buffer pointer
				header = readRegister(hspi,REG_FIFO_RX_BYTE_ADDR);

				// Condition to avoid an overflow (DO NOT REMOVE)
				if( HAL_GetTick() < previous )
				{
					previous = HAL_GetTick();
				}
			}

			// If packet received: Read first uint8_t of the received packet
			if( header != 0 )
			{
				_destination = readRegister(hspi, REG_FIFO);
			}
		}
		else
		{
			forme = false;
			_hreceived = false;
		}
	}
	else
	{
		/// FSK mode
		// read REG_IRQ_FLAGS2
		value = readRegister(hspi, REG_IRQ_FLAGS2);
		// Wait to Payload Ready interrupt
		while( (bitRead(value, 2) == 0) && (HAL_GetTick() - previous < wait) )
		{
			value = readRegister(hspi, REG_IRQ_FLAGS2);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}// end while
		if( bitRead(value, 2) == 1 )	// something received
		{
			_hreceived = true;
			// Reading first uint8_t of the received packet
			_destination = readRegister(hspi, REG_FIFO);
		}
		else
		{
			forme = false;
			_hreceived = false;
		}
	}


	/* We use '_hreceived' because we need to ensure that '_destination' value
	 * is correctly updated and is not the '_destination' value from the
	 * previously packet
	 */
	if( _hreceived == true )
	{
		// Checking destination
		if( (_destination == _nodeAddress) || (_destination == BROADCAST_0) )
		{ // LoRa or FSK mode
			forme = true;
		}
		else
		{
			forme = false;

			// If it is not a correct destination address, then change to
			// STANDBY to minimize power consumption
			if( _modem == LORA )
			{
				// Setting standby LoRa mode
				writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);
			}
			else
			{
				// Setting standby FSK mode
				writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);
			}
		}
	}
	else
	{
		// If timeout has expired, then change to
		// STANDBY to minimize power consumption
		if( _modem == LORA )
		{
			// Setting standby LoRa mode
 			writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);
		}
		else
		{
			// Setting standby FSK mode
			writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);
		}
	}
	return forme;
}

/*
 Function: If a packet is received, checks its destination.
 Returns: _Bool that's 'true' if the packet is for the module and
		  it's 'false' if the packet is not for the module.
*/
_Bool	availableData_MAX_TIMEOUT(SPI_HandleTypeDef *hspi)
{
	return availableData(hspi, MAX_TIMEOUT);
}
/*
 * Function: Clears the interruption flags
 *
 * LoRa Configuration registers are accessed through the SPI interface.
 * Registers are readable in all device mode including Sleep. However, they
 * should be written only in Sleep and Stand-by modes.
 *
 * Returns: Nothing
*/
void clearFlags(SPI_HandleTypeDef *hspi)
{
  uint8_t st0;
	// Save the previous status
	st0 = readRegister(hspi, REG_OP_MODE);
	if( _modem == LORA )
	{
		/// LoRa mode
		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);// Stdby mode to write in registers
		writeRegister(hspi, REG_IRQ_FLAGS, 0xFF);// LoRa mode flags register
		writeRegister(hspi, REG_OP_MODE, st0);// Getting back to previous status
	}
	else
	{
		/// FSK mode
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);	// Stdby mode to write in registers
		writeRegister(hspi, REG_IRQ_FLAGS1, 0xFF); // FSK mode flags1 register
		writeRegister(hspi, REG_IRQ_FLAGS2, 0xFF); // FSK mode flags2 register
		writeRegister(hspi, REG_OP_MODE, st0); // Getting back to previous status
	}
}
/*
 Function: It gets and stores an ACK if it is received, before ending 'wait' time.
 Returns: Integer that determines if there has been any error
   state = 8  --> The ACK lost
   state = 7  --> The ACK destination incorrectly received
   state = 6  --> The ACK source incorrectly received
   state = 5  --> The ACK number incorrectly received
   state = 4  --> The ACK length incorrectly received
   state = 3  --> N-ACK received
   state = 2  --> The ACK has not been received
   state = 1  --> not used (reserved)
   state = 0  --> The ACK has been received with no errors
 Parameters:
   wait: time to wait while there is no a valid header received.
*/
uint8_t getACK(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t state = 2;
	uint8_t value = 0x00;
	unsigned long previous;
	_Bool a_received = false;

  previous = HAL_GetTick();

	if( _modem == LORA )
	{ // LoRa mode
	    value = readRegister(hspi, REG_IRQ_FLAGS);
		// Wait until the ACK is received (RxDone flag) or the timeout expires
		while ((bitRead(value, 6) == 0) && (HAL_GetTick() - previous < wait))
		{
			value = readRegister(hspi, REG_IRQ_FLAGS);
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}
		if( bitRead(value, 6) == 1 )
		{ // ACK received
			a_received = true;
		}
		// Standby para minimizar el consumo
		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);	// Setting standby LoRa mode
	}
	else
	{ // FSK mode
		value = readRegister(hspi, REG_IRQ_FLAGS2);
		// Wait until the packet is received (RxDone flag) or the timeout expires
		while ((bitRead(value, 2) == 0) && (HAL_GetTick() - previous < wait))
		{
			value = readRegister(hspi, REG_IRQ_FLAGS2);
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}
		if( bitRead(value, 2) == 1 )
		{ // ACK received
			a_received = true;
		}
		// Standby para minimizar el consumo
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);	// Setting standby FSK mode
	}

	if( a_received )
	{
//----	writeRegister(REG_FIFO_ADDR_PTR, 0x00);  // Setting address pointer in FIFO data buffer
		// Storing the received ACK
		ACK.dst = _destination;
		ACK.src = readRegister(hspi, REG_FIFO);
		ACK.packnum = readRegister(hspi, REG_FIFO);
		ACK.length = readRegister(hspi, REG_FIFO);
		ACK.data[0] = readRegister(hspi, REG_FIFO);

