KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
		// Checking the received ACK
		if( ACK.dst == packet_sent.src )
		{
			if( ACK.src == packet_sent.dst )
			{
				if( ACK.packnum == packet_sent.packnum )
				{
					if( ACK.length == 0 )
					{
						if( ACK.data[0] == CORRECT_PACKET )
						{
							state = 0;
						}
						else
						{
							state = 3;
						}
					}
					else
					{
						state = 4;
					}
				}
				else
				{
					state = 5;
				}
			}
			else
			{
				state = 6;
			}
		}
		else
		{
			state = 7;
		}
	}
	else
	{
		state = 8;
	}
	clearFlags(hspi);	// Initializing flags
	return state;
}
/*
 Function: It gets and stores an ACK if it is received.
 Returns:
*/
uint8_t getACK_MAX_TIMEOUT(SPI_HandleTypeDef *hspi)
{
	return getACK(hspi, MAX_TIMEOUT);
}
/*
 Function: Checks if BW is a valid value.
 Returns: _Bool that's 'true' if the BW value exists and
		  it's 'false' if the BW value does not exist.
 Parameters:
   band: bandwidth value to check.
*/
_Bool	isBW(uint16_t band)
{
  // Checking available values for _bandwidth
  switch(band)
  {
	  case BW_7_8:
	  case BW_10_4:
	  case BW_15_6:
	  case BW_20_8:
	  case BW_31_2:
	  case BW_41_7:
	  case BW_62_5:
	  case BW_125:
	  case BW_250:
	  case BW_500:	check = true; break;

	  default:		check = false;
  }
	return check;
}
/*
 Function: Gets the BW within the module is configured.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	getBW(SPI_HandleTypeDef *hspi)
{
  int8_t state = 2;
  uint8_t config1;

  if( _modem == FSK )
  {
	  state = -1;		// BW is not available in FSK mode
  }
  else
  {
	  // take out bits 7-4 from REG_MODEM_CONFIG1 indicates _bandwidth
	  config1 = (readRegister(hspi, REG_MODEM_CONFIG1)) >> 4;
	  _bandwidth = config1;

	  if( (config1 == _bandwidth) && isBW(_bandwidth) )
	  {
		  state = 0;
	  }
	  else
	  {
		  state = 1;
	  }
  }
  return state;
}
/*
 Function: Checks if CR is a valid value.
 Returns: _Bool that's 'true' if the CR value exists and
		  it's 'false' if the CR value does not exist.
 Parameters:
   cod: coding rate value to check.
*/
_Bool	isCR(uint8_t cod)
{
	// Checking available values for _codingRate
  switch(cod)
  {
	  case CR_5:
	  case CR_6:
	  case CR_7:
	  case CR_8:	check = true;
					break;

	  default:		check = false;
  }
	return check;
}
/*
 Function: Indicates the CR within the module is configured.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	getCR(SPI_HandleTypeDef *hspi)
{
  int8_t state = 2;
  uint8_t config1;

  if( _modem == FSK )
  {
	  state = -1;		// CR is not available in FSK mode
  }
  else
  {
	// take out bits 7-3 from REG_MODEM_CONFIG1 indicates _bandwidth & _codingRate
	config1 = (readRegister(hspi, REG_MODEM_CONFIG1)) >> 1;
	config1 = config1 & 7;	// clears bits 7-4 ---> clears _bandwidth
	_codingRate = config1;
	state = 1;

	if( (config1 == _codingRate) && isCR(_codingRate) )
	{
		state = 0;
	}
  }
  return state;
}
/*
 Function: Indicates if module is configured with or without checking CRC.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	getCRC(SPI_HandleTypeDef *hspi)
{
	int8_t state = 2;
	uint8_t value;

	if( _modem == LORA )
	{ // LoRa mode

		// take out bit 2 from REG_MODEM_CONFIG2 indicates RxPayloadCrcOn
		value = readRegister(hspi, REG_MODEM_CONFIG2);
		if( bitRead(value, 2) == CRC_OFF )
		{ // CRCoff
			_CRC = CRC_OFF;
			state = 0;
		}
		else
		{ // CRCon
			_CRC = CRC_ON;
			state = 0;
		}
	}
	else
	{ // FSK mode

		// take out bit 2 from REG_PACKET_CONFIG1 indicates CrcOn
		value = readRegister(hspi, REG_PACKET_CONFIG1);
		if( bitRead(value, 4) == CRC_OFF )
		{ // CRCoff
			_CRC = CRC_OFF;
			state = 0;
		}
		else
		{ // CRCon
			_CRC = CRC_ON;
			state = 0;
		}
	}
	if( state != 0 )
	{
		state = 1;
	}
	return state;
}

/*
 Function: Checks if channel is a valid value.
 Returns: _Bool that's 'true' if the CR value exists and
		  it's 'false' if the CR value does not exist.
 Parameters:
   ch: frequency channel value to check.
*/
_Bool	isChannel(uint32_t ch)
{
  // Checking available values for _channel
  switch(ch)
  {
	  case CH_1_BW_500:check = true;break;
	  case CH_2_BW_500:check = true; break;// same value that CH_7_BW_125
	  case CH_3_BW_500:check = true;break;

	  case CH_1_BW_250:check = true;break;
	  case CH_2_BW_250:check = true;break;
	  case CH_3_BW_250:check = true;break;
	  case CH_4_BW_250:check = true;break;
	  case CH_5_BW_250:check = true;break;
	  case CH_6_BW_250:check = true;break;

	  case CH_1_BW_125:check = true;break;
	  case CH_2_BW_125:check = true;break;
	  case CH_3_BW_125:check = true;break;
	  case CH_4_BW_125:check = true;break;
	  case CH_5_BW_125:check = true;break;
	  case CH_6_BW_125:check = true;break;
	  case CH_8_BW_125:check = true;break;
	  case CH_9_BW_125:check = true;break;
	  case CH_10_BW_125:check = true;break;
	  case CH_11_BW_125:check = true;break;
	  case CH_12_BW_125:check = true;break;
	  case CH_13_BW_125:check = true;break;

	  case CH_1:check = true;break;
	  case CH_2:check = true;break;
	  case CH_3:check = true;break;
	  case CH_4:check = true;break;
	  case CH_5:check = true;break;
	  case CH_6:check = true;break;
	  case CH_7:check = true;break;
	  case CH_8:check = true;break;
	  case CH_9:check = true;break;
	  case CH_10:check = true;break;
	  case CH_11:check = true;break;
	  case CH_12:check = true;break;
	  case CH_13:check = true;break;
	  case CH_14:check = true;break;
	  case CH_15:check = true;break;
	  case CH_16:check = true;break;
	  case CH_17:check = true;break;
	  case CH_18:check = true;break;
	  case CH_19:check = true;break;
	  case CH_20:check = true;break;
	  case CH_21:check = true;break;
	  case CH_22:check = true;break;
	  case CH_23:check = true;break;
	  case CH_24:		check = true;
				break;

	  default:		check = false;
  }
	return check;
}
/*
 Function: Indicates the frequency channel within the module is configured.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getChannel(SPI_HandleTypeDef *hspi)
{
  uint8_t state = 2;
  uint32_t ch;
  uint8_t freq3;
  uint8_t freq2;
  uint8_t freq1;

  freq3 = readRegister(hspi, REG_FRF_MSB);	// frequency channel MSB
  freq2 = readRegister(hspi, REG_FRF_MID);	// frequency channel MID
  freq1 = readRegister(hspi, REG_FRF_LSB);	// frequency channel LSB
  ch = ((uint32_t)freq3 << 16) + ((uint32_t)freq2 << 8) + (uint32_t)freq1;
  _channel = ch;						// frequency channel

  if( (_channel == ch) && isChannel(_channel) )
  {
	  state = 0;
  }
  else
  {
	  state = 1;
  }
  return state;
}
/*
 Function: Indicates if module is configured in implicit or explicit header mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	getHeader(void)
{
	int8_t state = 2;

	// take out bit 2 from REG_MODEM_CONFIG1 indicates ImplicitHeaderModeOn
	if( bitRead(REG_MODEM_CONFIG1, 0) == 0 )
	{ // explicit header mode (ON)
		_header = HEADER_ON;
		state = 1;
	}
	else
	{ // implicit header mode (OFF)
		_header = HEADER_OFF;
		state = 1;
	}
	state = 0;
	return state;
}
/*
 Function: Gets the current supply limit of the power amplifier, protecting battery chemistries.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   rate: value to compute the maximum current supply. Maximum current is 45+5*'rate' [mA]
*/
uint8_t getMaxCurrent(SPI_HandleTypeDef *hspi)
{
	int8_t state = 2;
	uint8_t value;

	state = 1;
	_maxCurrent = readRegister(hspi, REG_OCP);

	// extract only the OcpTrim value from the OCP register
	_maxCurrent &= 31;

	if( _maxCurrent <= 15 )
	{
		value = (45 + (5 * _maxCurrent));
	}
	else if( _maxCurrent <= 27 )
	{
		value = (-30 + (10 * _maxCurrent));
	}
	else
	{
		value = 240;
	}

