KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
	_maxCurrent = value;
	state = 0;
	return state;
}
/*
 Function: Sets the module in LoRa mode.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t setLORA(SPI_HandleTypeDef *hspi)
{
    uint8_t state = 2;
    uint8_t st0;

	writeRegister(hspi, REG_OP_MODE, FSK_SLEEP_MODE);    // Sleep mode (mandatory to set LoRa mode)
	writeRegister(hspi, REG_OP_MODE, LORA_SLEEP_MODE);    // LoRa sleep mode
	writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);	// LoRa standby mode

	writeRegister(hspi, REG_MAX_PAYLOAD_LENGTH,MAX_LENGTH);

	// Set RegModemConfig1 to Default values
	writeRegister(hspi, REG_MODEM_CONFIG1, 0x72);
	// Set RegModemConfig2 to Default values
	writeRegister(hspi, REG_MODEM_CONFIG2, 0x70);
	// Set RegModemConfig2 to Default values
	writeRegister(hspi, REG_MODEM_CONFIG3, 0x00);

	//delay(100);

	st0 = readRegister(hspi, REG_OP_MODE);	// Reading config mode
	if( st0 == LORA_STANDBY_MODE )
	{ // LoRa mode
		_modem = LORA;
		state = 0;
	}
	else
	{ // FSK mode
		_modem = FSK;
		state = 1;
	}
	return state;
}
/*
 Function: Limits the current supply of the power amplifier, protecting battery chemistries.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden parameter value for this function
 Parameters:
   rate: value to compute the maximum current supply. Range: 0x00 to 0x1B. The
   Maximum current is:
	Imax = 45+5*OcpTrim [mA] 	if OcpTrim <= 15 (120 mA) /
	Imax = -30+10*OcpTrim [mA] 	if 15 < OcpTrim <= 27 (130 to 240 mA)
	Imax = 240mA 				for higher settings
*/
int8_t setMaxCurrent(SPI_HandleTypeDef *hspi, uint8_t rate)
{
	int8_t state = 2;
	uint8_t st0;

	// Maximum rate value = 0x1B, because maximum current supply = 240 mA
	if (rate > 0x1B)
	{
		state = -1;
	}
	else
	{
		// Enable Over Current Protection
		rate |= 32;

		state = 1;
		st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status
		if( _modem == LORA )
		{ // LoRa mode
			writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);	// Set LoRa Standby mode to write in registers
		}
		else
		{ // FSK mode
			writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);	// Set FSK Standby mode to write in registers
		}
		writeRegister(hspi, REG_OCP, rate);		// Modifying maximum current supply
		writeRegister(hspi, REG_OP_MODE, st0);		// Getting back to previous status
		state = 0;
	}
	return state;
}
/*
 Function: Sets the node address in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   addr: address value to set as node address.
*/
int8_t setNodeAddress(SPI_HandleTypeDef *hspi, uint8_t addr)
{
	uint8_t st0;
	int8_t value;
	int8_t state = 2;

	// check address value is within valid range
	if( addr > 255 )
	{
		state = -1;
	}
	else
	{
		// Saving node address
		_nodeAddress = addr;
		st0 = readRegister(hspi, REG_OP_MODE);	  // Save the previous status

		// in LoRa mode
		state = 0;

		if( _modem == LORA )
		{
			// in LoRa mode, address is SW controlled
			// set status to success
			state = 0;
		}
		else if( _modem == FSK )
		{
			//Set FSK Standby mode to write in registers
			writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);

			// Storing node and broadcast address
			writeRegister(hspi, REG_NODE_ADRS, addr);
			writeRegister(hspi, REG_BROADCAST_ADRS, BROADCAST_0);

			value = readRegister(hspi, REG_NODE_ADRS);
			writeRegister(hspi, REG_OP_MODE, st0);		// Getting back to previous status

			if( value == _nodeAddress )
			{
				state = 0;
			}
			else
			{
				state = 1;
			}
		}
	}
	return state;
}
/*
 Function: It sets the packet destination.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   dest: destination value of the packet sent.
*/
int8_t setDestination(uint8_t dest)
{
	int8_t state = 2;

	state = 1;
	_destination = dest; // Storing destination in a global variable
	packet_sent.dst = dest;	 // Setting destination in packet structure
	packet_sent.src = _nodeAddress; // Setting source in packet structure
	packet_sent.packnum = _packetNumber;	// Setting packet number in packet structure
	_packetNumber++;
	state = 0;
	return state;
}
/*
 Function: It truncs the payload length if it is greater than 0xFF.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t truncPayload(uint16_t length16)
{
	uint8_t state = 2;
	state = 1;

	if( length16 > MAX_PAYLOAD)
	{
		_payloadlength = MAX_PAYLOAD;
	}
	else
	{
		_payloadlength = (length16 & 0xFF);
	}
	state = 0;
	return state;
}
/*
 Function: Sets the packet length in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   l: length value to set as payload length.
*/
int8_t setPacketLength(SPI_HandleTypeDef *hspi, uint8_t l)
{
	uint8_t st0;
	uint8_t value = 0x00;
	int8_t state = 2;

	st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status
	//----
	//	truncPayload(l);
	packet_sent.length = l;
	//
	if( _modem == LORA )
  	{ // LORA mode
  		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);    // Set LoRa Standby mode to write in registers
		writeRegister(hspi, REG_PAYLOAD_LENGTH_LORA, packet_sent.length);
		// Storing payload length in LoRa mode
		value = readRegister(hspi, REG_PAYLOAD_LENGTH_LORA);
	}
	else
	{ // FSK mode
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);    //  Set FSK Standby mode to write in registers
		writeRegister(hspi, REG_PAYLOAD_LENGTH_FSK, packet_sent.length);
		// Storing payload length in FSK mode
		value = readRegister(hspi, REG_PAYLOAD_LENGTH_FSK);
	}

	if( packet_sent.length == value )
	{
		state = 0;
	}
	else
	{
		state = 1;
	}
	writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
  	//delay(250);
	return state;
}
/*
 Function: Sets the packet length in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t setPacketLength_payloadlength(SPI_HandleTypeDef *hspi)
{
	uint16_t length;
	length = _payloadlength + OFFSET_PAYLOADLENGTH;
	return setPacketLength(hspi, length);
}
/*
 Function: It sets a packet struct in FIFO in order to send it.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t setPacket(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload)
{
	int8_t state = 2;
	uint8_t st0;

