KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
	// Save the previous status
	st0 = readRegister(hspi, REG_OP_MODE);
	// Initializing flags
	clearFlags(hspi);

	// Updating incorrect value
	_reception = CORRECT_PACKET;


	if (_retries == 0)
	{
		// Updating these values only if it is the first try
		// Setting destination in packet structure
		state = setDestination(dest);
		if( state == 0 )
		{
			state = setPayload(hspi, payload);
		}
	}
	else
	{
		state = setPacketLength_payloadlength(hspi);
		packet_sent.retry = _retries;
	}

	// Setting address pointer in FIFO data buffer
	writeRegister(hspi, REG_FIFO_TX_BASE_ADDR, 0x00);
	writeRegister(hspi, REG_FIFO_ADDR_PTR, 0x00);
	if( state == 0 )
	{
		state = 1;
		// Writing packet to send in FIFO
		writeRegister(hspi, REG_FIFO, packet_sent.dst); 		// Writing the destination in FIFO
		writeRegister(hspi, REG_FIFO, packet_sent.src);		// Writing the source in FIFO
		writeRegister(hspi, REG_FIFO, packet_sent.packnum);	// Writing the packet number in FIFO
		writeRegister(hspi, REG_FIFO, packet_sent.length); 	// Writing the packet length in FIFO
		for( uint16_t i = 0; i < _payloadlength; i++)
		{
			writeRegister(hspi, REG_FIFO, packet_sent.data[i]);  // Writing the payload in FIFO
		}
		writeRegister(hspi, REG_FIFO, packet_sent.retry);		// Writing the number retry in FIFO
		state = 0;
	}
	writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
	return state;
}
/*
 Function: Checks if SF is a valid value.
 Returns: _Bool that's 'true' if the SF value exists and
		  it's 'false' if the SF value does not exist.
 Parameters:
   spr: spreading factor value to check.
*/
_Bool	isSF(uint8_t spr)
{
  // Checking available values for _spreadingFactor
  switch(spr)
  {
	  case SF_6:
	  case SF_7:
	  case SF_8:
	  case SF_9:
	  case SF_10:
	  case SF_11:
	  case SF_12:	check = true;
					break;

	  default:		check = false;
  }
	return check;
}
/*
 Function: Sets the module in implicit header mode (header is not sent).
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	setHeaderOFF(SPI_HandleTypeDef *hspi)
{
	int8_t state = 2;
	uint8_t config1;

	if( _modem == FSK )
	{
		// header is not available in FSK mode
		state = -1;
	}
	else
	{
		// lay du gia tri thanh ghi REG_MODEM_CONFIG1
		config1 = readRegister(hspi, REG_MODEM_CONFIG1);

		// dat bit 2 = 1 REG_MODEM_CONFIG1 <=> headerOFF
		config1 = config1 | 1;
		//cap nhat lai thanh ghi
		writeRegister(hspi, REG_MODEM_CONFIG1,config1);

		// check register
		config1 = readRegister(hspi, REG_MODEM_CONFIG1);
		if( bitRead(config1, 2) == HEADER_OFF )
		{
			// checking headerOFF taking out bit 2 from REG_MODEM_CONFIG1
			state = 0;
			_header = HEADER_OFF;
		}
		else
		{
			state = 1;
		}
	}
	return state;
}
/*
 Function: Sets the indicated SF in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   spr: spreading factor value to set in LoRa modem configuration.
*/
uint8_t	setSF(SPI_HandleTypeDef *hspi, uint8_t spr)
{
	uint8_t st0;
	int8_t state = 2;
	uint8_t config2;
	uint8_t config3;

	st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status

	if( _modem == FSK )
	{
		/// FSK mode
		state = setLORA(hspi);				// Setting LoRa mode
	}
	else
	{
		/// LoRa mode
		// LoRa standby mode
		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);

		// Read config2 to modify SF value (bits 7-4)
		config2 = (readRegister(hspi, REG_MODEM_CONFIG2));
		// Read config3 to modify only the LowDataRateOptimize
		config3 = (readRegister(hspi, REG_MODEM_CONFIG3));

		switch(spr)
		{
			case SF_6:
					config2 = config2 & 111;	// clears bits 7 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 96;	// sets bits 6 & 5 from REG_MODEM_CONFIG2
					break;
			case SF_7:
					config2 = config2 & 127;	// clears bits 7 from REG_MODEM_CONFIG2
					config2 = config2 | 112;	// sets bits 6, 5 & 4
					break;

			case SF_8:
					config2 = config2 & 143;	// clears bits 6, 5 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 128;	// sets bit 7 from REG_MODEM_CONFIG2
					break;

			case SF_9:
					config2 = config2 & 159;	// clears bits 6, 5 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 144;	// sets bits 7 & 4 from REG_MODEM_CONFIG2
					break;

			case SF_10:	config2 = config2 & 175;	// clears bits 6 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 160;	// sets bits 7 & 5 from REG_MODEM_CONFIG2
					break;

			case SF_11:
					config2 = config2 & 191;	// clears bit 6 from REG_MODEM_CONFIG2
					config2 = config2 | 176;	// sets bits 7, 5 & 4 from REG_MODEM_CONFIG2
					getBW(hspi);
					if( _bandwidth == BW_125 )
					{ // LowDataRateOptimize (Mandatory with SF_11 if BW_125)
						config3 = config3 | 8;
					}
					break;

			case SF_12:
					config2 = config2 & 207;	// clears bits 5 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 192;	// sets bits 7 & 6 from REG_MODEM_CONFIG2

					getBW(hspi);
					if( _bandwidth == BW_125 )
					{ // LowDataRateOptimize (Mandatory with SF_12 if BW_125)
						config3 = config3 | 8;
					}
					break;
	}

	// Check if it is neccesary to set special settings for SF=6
	if( spr == SF_6 )
	{
		// Mandatory headerOFF with SF = 6 (Implicit mode)
		setHeaderOFF(hspi);

		// Set the bit field DetectionOptimize of
		// register RegLoRaDetectOptimize to value "0b101".
		writeRegister(hspi, REG_DETECT_OPTIMIZE, 0x05);

		// Write 0x0C in the register RegDetectionThreshold.
		writeRegister(hspi, REG_DETECTION_THRESHOLD, 0x0C);
	}
	else
	{
		// LoRa detection Optimize: 0x03 --> SF7 to SF12
		writeRegister(hspi, REG_DETECT_OPTIMIZE, 0x03);

		// LoRa detection threshold: 0x0A --> SF7 to SF12
		writeRegister(hspi, REG_DETECTION_THRESHOLD, 0x0A);
	}

	// sets bit 1-0 of REG_MODEM_CONFIG2 (SymbTimout) and bit 2 of REG_MODEM_CONFIG3 (AgcAutoOn) for any SF value
	config2 = config2 | 3;
	config3 = config3 | 4;

	// Update 'config2' and 'config3'
	writeRegister(hspi, REG_MODEM_CONFIG2, config2);
	writeRegister(hspi, REG_MODEM_CONFIG3, config3);

	// Read 'config2' and 'config3' to check update
	config2 = (readRegister(hspi, REG_MODEM_CONFIG2));
	config3 = (readRegister(hspi, REG_MODEM_CONFIG3));

	// (config2 >> 4) ---> take out bits 7-4 from REG_MODEM_CONFIG2 (=_spreadingFactor)
	// bitRead(config3, 3) ---> take out bits 1 from config3 (=LowDataRateOptimize)
	switch(spr)
	{
		case SF_6:	if(		((config2 >> 4) == spr)
						&& 	(bitRead(config3, 2) == 1)
						&& 	(_header == HEADER_OFF))
					{
						state = 0;
					}
					break;
		case SF_7:	if(		((config2 >> 4) == 0x07)
						 && (bitRead(config3, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_8:	if(		((config2 >> 4) == 0x08)
						 && (bitRead(config3, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_9:	if(		((config2 >> 4) == 0x09)
						 && (bitRead(config3, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_10:	if(		((config2 >> 4) == 0x0A)
						 && (bitRead(config3, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_11:	getBW(hspi);
				if(		((config2 >> 4) == 0x0B)
						 && (bitRead(config3, 2) == 1)
						 && (_bandwidth != BW_125))
					{
						state = 0;
					}
				else if		((_bandwidth == BW_125)
						 && (bitRead(config3, 3) == 1))
					{
						state = 0;
					}
					break;
		case SF_12:	getBW(hspi);
				if(		((config2 >> 4) == 0x0C)
						 && (bitRead(config3, 2) == 1)
						 && (_bandwidth != BW_125))
					{
						state = 0;
					}
				else if		((_bandwidth == BW_125)
						 && (bitRead(config3, 3) == 1))
					{
						state = 0;
					}
					break;
		default:	state = 1;
	}
  }

