KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
  writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status

  if( isSF(spr) )
  { // Checking available value for _spreadingFactor
		state = 0;
		_spreadingFactor = spr;
  }
  return state;
}
/*
 Function: It sets an ACK in FIFO in order to send it.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t setACK(SPI_HandleTypeDef *hspi)
{
	uint8_t state = 2;


	clearFlags(hspi);	// Initializing flags

	if( _modem == LORA )
	{ // LoRa mode
		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);	// Stdby LoRa mode to write in FIFO
	}
	else
	{ // FSK mode
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);	// Stdby FSK mode to write in FIFO
	}

	// Setting ACK length in order to send it
	state = setPacketLength(hspi, ACK_LENGTH);
	if( state == 0 )
	{
		// Setting ACK
		memset( &ACK, 0x00, sizeof(ACK) );
		ACK.dst = packet_received.src; // ACK destination is packet source
		ACK.src = packet_received.dst; // ACK source is packet destination
		ACK.packnum = packet_received.packnum; // packet number that has been correctly received
		ACK.length = 0;		  // length = 0 to show that's an ACK
		ACK.data[0] = _reception;	// CRC of the received packet

		// Setting address pointer in FIFO data buffer
		writeRegister(hspi, REG_FIFO_ADDR_PTR, 0x00);
		writeRegister(hspi, REG_FIFO_TX_BASE_ADDR, 0x00);

		state = 1;

		// Writing ACK to send in FIFO
		writeRegister(hspi, REG_FIFO, ACK.dst); 		// Writing the destination in FIFO
		writeRegister(hspi, REG_FIFO, ACK.src);		// Writing the source in FIFO
		writeRegister(hspi, REG_FIFO, ACK.packnum);	// Writing the packet number in FIFO
		writeRegister(hspi, REG_FIFO, ACK.length); 	// Writing the packet length in FIFO
		writeRegister(hspi, REG_FIFO, ACK.data[0]);	// Writing the ACK in FIFO

		state = 0;
		_reception = CORRECT_PACKET;		// Updating value to next packet

		HAL_Delay(500);
	}
	return state;
}
/*
 Function: Gets the SF within the module is configured.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	getSF(SPI_HandleTypeDef *hspi)
{
  int8_t state = 2;
  uint8_t config2;

  if( _modem == FSK )
  {
	  state = -1;		// SF is not available in FSK mode
  }
  else
  {
	// take out bits 7-4 from REG_MODEM_CONFIG2 indicates _spreadingFactor
	config2 = (readRegister(hspi, REG_MODEM_CONFIG2)) >> 4;
	_spreadingFactor = config2;
	state = 1;

	if( (config2 == _spreadingFactor) && isSF(_spreadingFactor) )
	{
		state = 0;
	}
  }
  return state;
}
/*
 Function: Sets the indicated BW in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   band: bandwith value to set in LoRa modem configuration.
*/
int8_t	setBW(SPI_HandleTypeDef *hspi, uint16_t band)
{
  uint8_t st0;
  int8_t state = 2;
  uint8_t config1;
  uint8_t config3;

  st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status

  if( _modem == FSK )
  {
	  state = setLORA(hspi);
  }
  writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);	// LoRa standby mode
  config1 = (readRegister(hspi, REG_MODEM_CONFIG1));	// Save config1 to modify the BW
  config3 = (readRegister(hspi, REG_MODEM_CONFIG3));	// Save config3 to modify the Low Data Rate Optimization
  switch(band)
  {
	case BW_7_8:  	config1 = config1 & 15;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 0;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_10_4: config1 = config1 & 31;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 16;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_15_6: config1 = config1 & 47;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 32;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_20_8: config1 = config1 & 8;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 48;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_31_2: config1 = config1 & 79;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 64;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_41_7: config1 = config1 & 95;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 80;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_62_5: config1 = config1 & 111;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 96;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_125:  config1 = config1 & 127;	// clears bits 7-4 from REG_MODEM_CONFIG1
			config1 = config1 | 112;	//sets bit 7-4 from REG_MODEM_CONFIG1
			getSF(hspi);
			if( _spreadingFactor == 11 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_11)
				config3 = config3 | 8;
			}
			if( _spreadingFactor == 12 )
			{ // LowDataRateOptimize (Mandatory with BW_125 if SF_12)
				config3 = config3 | 8;
			}
			break;
	  case BW_250:  config1 = config1 & 143;	// clears bit 7 from REG_MODEM_CONFIG1
			config1 = config1 | 128;	// sets bit 6 from REG_MODEM_CONFIG1
			break;
	  case BW_500:  config1 = config1 & 159;	//clears bit 6 from REG_MODEM_CONFIG1
			config1 = config1 | 144;	//sets bit 7 from REG_MODEM_CONFIG1
			break;

