KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
  }
  writeRegister(hspi, REG_MODEM_CONFIG1,config1);		// Update config1
  writeRegister(hspi, REG_MODEM_CONFIG3,config3);		// Update config3

  config1 = (readRegister(hspi, REG_MODEM_CONFIG1));
  config3 = (readRegister(hspi, REG_MODEM_CONFIG3));
  // (config1 >> 4) ---> take out bits 7-4 from REG_MODEM_CONFIG1 (=_bandwidth)
  switch(band)
  {
	   case BW_7_8: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_10_4: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_15_6: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_20_8: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_31_2: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_41_7: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_62_5: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_125: if( (config1 >> 4) == BW_125 )
					{
						state = 0;
						getSF(hspi);
						if( _spreadingFactor == 11 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
						if( _spreadingFactor == 12 )
						{
							if( bitRead(config3, 3) == 1 )
							{ // LowDataRateOptimize
								state = 0;
							}
							else
							{
								state = 1;
							}
						}
					}
					break;
	   case BW_250: if( (config1 >> 4) == BW_250 )
					{
						state = 0;
					}
					break;
	   case BW_500: if( (config1 >> 4) == BW_500 )
					{
						state = 0;
					}
					break;
  }

  if( ~isBW(band) )
  {
	  state = 1;
  }
  else
  {
	  _bandwidth = band;
  }
  writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
  return state;
}
/*
 Function: Sets the indicated CR in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   cod: coding rate value to set in LoRa modem configuration.
*/
int8_t	setCR(SPI_HandleTypeDef *hspi, uint8_t cod)
{
  uint8_t st0;
  int8_t state = 2;
  uint8_t config1;

  st0 = readRegister(hspi, REG_OP_MODE);		// Save the previous status

  if( _modem == FSK )
  {
	  state = setLORA(hspi);
  }
  else
  {
	  writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);		// Set Standby mode to write in registers

	  config1 = readRegister(hspi, REG_MODEM_CONFIG1);	// Save config1 to modify only the CR
	  switch(cod)
	  {
		 case CR_5: config1 = config1 & 243;	// clears bits 3 & 2 from REG_MODEM_CONFIG1
			    config1 = config1 | 2;	// sets bit 1 from REG_MODEM_CONFIG1
			    break;
		 case CR_6: config1 = config1 & 245;	// clears bits 3 & 1 from REG_MODEM_CONFIG1
			    config1 = config1 | 4;	// sets bit 2 from REG_MODEM_CONFIG1
			    break;
		 case CR_7: config1 = config1 & 247;	// clears bit 3 from REG_MODEM_CONFIG1
			    config1 = config1 | 6;	// sets bits 2 & 1 from REG_MODEM_CONFIG1
			    break;
		 case CR_8: config1 = config1 & 249;	// clears bits 2 & 1 from REG_MODEM_CONFIG1
			    config1 = config1 | 8;	// sets bit 3 from REG_MODEM_CONFIG1
			    break;
	  }
	  writeRegister(hspi, REG_MODEM_CONFIG1, config1);		// Update config1

	  config1 = readRegister(hspi, REG_MODEM_CONFIG1);
	  // ((config1 >> 3) & B0000111) ---> take out bits 5-3 from REG_MODEM_CONFIG1 (=_codingRate)
	  switch(cod)
	  {
		 case CR_5: if( ((config1 >> 1) & 7) == 0x01 )
					{
						state = 0;
					}
					break;
		 case CR_6: if( ((config1 >> 1) & 7) == 0x02 )
					{
						state = 0;
					}
					break;
		 case CR_7: if( ((config1 >> 1) & 7) == 0x03 )
					{
						state = 0;
					}
					break;
		 case CR_8: if( ((config1 >> 1) & 7) == 0x04 )
					{
						state = 0;
					}
					break;
	  }
  }

  if( isCR(cod) )
  {
	  _codingRate = cod;
  }
  else
  {
	  state = 1;
  }
  writeRegister(hspi, REG_OP_MODE,st0);	// Getting back to previous status
  return state;
}
/*
 Function: Sets the module with CRC on.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	setCRC_ON(SPI_HandleTypeDef *hspi)
{
  uint8_t state = 2;
  uint8_t config;

  if( _modem == LORA )
  { // LORA mode
	config = readRegister(hspi, REG_MODEM_CONFIG2);	// Save config to modify only the CRC bit
	config = config | 4;				// sets bit 2 from REG_MODEM_CONFIG2 = CRC_ON
	writeRegister(hspi, REG_MODEM_CONFIG2,config);

	state = 1;

	config = readRegister(hspi, REG_MODEM_CONFIG2);
	if( bitRead(config, 2) == CRC_ON )
	{ // take out bit 1 from REG_MODEM_CONFIG2 indicates RxPayloadCrcOn
		state = 0;
		_CRC = CRC_ON;
	}
  }
  else
  { // FSK mode
	config = readRegister(hspi, REG_PACKET_CONFIG1);	// Save config to modify only the CRC bit
	config = config | 16;				// set bit 4 from REG_PACKET_CONFIG1 = CRC_ON
	writeRegister(hspi, REG_PACKET_CONFIG1,config);

	state = 1;

	config = readRegister(hspi, REG_PACKET_CONFIG1);
	if( bitRead(config, 4) == CRC_ON )
	{ // take out bit 4 from REG_PACKET_CONFIG1 indicates CrcOn
		state = 0;
		_CRC = CRC_ON;
	}
  }
  if( state != 0 )
  {
	  state = 1;
  }
  return state;
}

