KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
/*
 Function: Sets the module with CRC off.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	setCRC_OFF(SPI_HandleTypeDef *hspi)
{
  int8_t state = 2;
  uint8_t config;

  if( _modem == LORA )
  { // LORA mode
  	config = readRegister(hspi, REG_MODEM_CONFIG2);	// Save config1 to modify only the CRC bit
	config = config & 251;				// clears bit 1 from config1 = CRC_OFF
	writeRegister(hspi, REG_MODEM_CONFIG2,config);

	config = readRegister(hspi, REG_MODEM_CONFIG2);
	if( (bitRead(config, 2)) == CRC_OFF )
	{ // take out bit 1 from REG_MODEM_CONFIG2 indicates RxPayloadCrcOn
	  state = 0;
	  _CRC = CRC_OFF;
	}
  }
  else
  { // FSK mode
	config = readRegister(hspi, REG_PACKET_CONFIG1);	// Save config1 to modify only the CRC bit
	config = config & 239;				// clears bit 4 from config1 = CRC_OFF
	writeRegister(hspi, REG_PACKET_CONFIG1,config);

	config = readRegister(hspi, REG_PACKET_CONFIG1);
	if( bitRead(config, 4) == CRC_OFF )
	{ // take out bit 4 from REG_PACKET_CONFIG1 indicates RxPayloadCrcOn
		state = 0;
		_CRC = CRC_OFF;
	}
  }
  if( state != 0 )
  {
	  state = 1;
  }
  return state;
}
/*
 Function: Sets the indicated channel in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   ch: frequency channel value to set in configuration.
*/
int8_t setChannel(SPI_HandleTypeDef *hspi, uint32_t ch)
{
  uint8_t st0;
  int8_t state = 2;
  unsigned int freq3;
  unsigned int freq2;
  uint8_t freq1;
  uint32_t freq;

  st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status
  if( _modem == LORA )
  {
	  // LoRa Stdby mode in order to write in registers
	  writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);
  }
  else
  {
	  // FSK Stdby mode in order to write in registers
	  writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);
  }

  freq3 = ((ch >> 16) & 0x0FF);		// frequency channel MSB
  freq2 = ((ch >> 8) & 0x0FF);		// frequency channel MIB
  freq1 = (ch & 0xFF);				// frequency channel LSB

  writeRegister(hspi, REG_FRF_MSB, freq3);
  writeRegister(hspi, REG_FRF_MID, freq2);
  writeRegister(hspi, REG_FRF_LSB, freq1);

  // storing MSB in freq channel value
  freq3 = (readRegister(hspi, REG_FRF_MSB));
  freq = (freq3 << 8) & 0xFFFFFF;

  // storing MID in freq channel value
  freq2 = (readRegister(hspi, REG_FRF_MID));
  freq = (freq << 8) + ((freq2 << 8) & 0xFFFFFF);

  // storing LSB in freq channel value
  freq = freq + ((readRegister(hspi, REG_FRF_LSB)) & 0xFFFFFF);

  if( freq == ch )
  {
    state = 0;
    _channel = ch;
  }
  else
  {
    state = 1;
  }

  if( ~ isChannel(ch) )
  {
	 state = -1;
  }

  writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
  return state;
}
/*
 Function: Sets the module in FSK mode.
 Returns:   Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t setFSK(SPI_HandleTypeDef *hspi)
{
	uint8_t state = 2;
    uint8_t st0;
    uint8_t config1;

	writeRegister(hspi, REG_OP_MODE, FSK_SLEEP_MODE);	// Sleep mode (mandatory to change mode)
	writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);	// FSK standby mode
	config1 = readRegister(hspi, REG_PACKET_CONFIG1);
	config1 = config1 & 125;		// clears bits 8 and 1 from REG_PACKET_CONFIG1
	config1 = config1 | 4;		// sets bit 2 from REG_PACKET_CONFIG1
	writeRegister(hspi, REG_PACKET_CONFIG1,config1);	// AddressFiltering = NodeAddress + BroadcastAddress
	writeRegister(hspi, REG_FIFO_THRESH, 0x80);	// condition to start packet tx
	config1 = readRegister(hspi, REG_SYNC_CONFIG);
	config1 = config1 & 63;
	writeRegister(hspi, REG_SYNC_CONFIG,config1);

	//delay(100);

	st0 = readRegister(hspi, REG_OP_MODE);	// Reading config mode
	if( st0 == FSK_STANDBY_MODE )
	{ // FSK mode
		_modem = FSK;
		state = 0;
	}
	else
	{ // LoRa mode
		_modem = LORA;
		state = 1;
	}
	return state;
}
/*
 Function: Sets the module in explicit header mode (header is sent).
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	setHeaderON(SPI_HandleTypeDef *hspi)
{
  int8_t state = 2;
  uint8_t config1;

  if( _modem == FSK )
  {
	  state = -1;		// header is not available in FSK mode
  }
  else
  {
	config1 = readRegister(hspi, REG_MODEM_CONFIG1);	// Save config1 to modify only the header bit
	if( _spreadingFactor == 6 )
	{
		state = -1;		// Mandatory headerOFF with SF = 6
	}
	else
	{
		config1 = config1 & 254;			// clears bit 2 from config1 = headerON
		writeRegister(hspi, REG_MODEM_CONFIG1,config1);	// Update config1
	}
	if( _spreadingFactor != 6 )
	{ // checking headerON taking out bit 2 from REG_MODEM_CONFIG1
		config1 = readRegister(hspi, REG_MODEM_CONFIG1);
		if( bitRead(config1, 0) == HEADER_ON )
		{
			state = 0;
			_header = HEADER_ON;
		}
		else
		{
			state = 1;
		}
	}
  }
  return state;
}
/*
 Function: Sets the bandwidth, coding rate and spreading factor of the LoRa modulation.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   mode: mode number to set the required BW, SF and CR of LoRa modem.
*/
int8_t setMode(SPI_HandleTypeDef *hspi, uint8_t mode)
{
	int8_t state = 2;
	uint8_t st0;
	uint8_t config1 = 0x00;
	uint8_t config2 = 0x00;

	st0 = readRegister(hspi, REG_OP_MODE);		// Save the previous status

	// 'setMode' function only can be called in LoRa mode
	if( _modem == FSK )
	{
		setLORA(hspi);
	}

	// LoRa standby mode
	writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);

	switch (mode)
	{
		// mode 1 (better reach, medium time on air)
		case 1: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_12);		// SF = 12
					setBW(hspi, BW_125);		// BW = 125 KHz
					break;

		// mode 2 (medium reach, less time on air)
		case 2: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_12);		// SF = 12
					setBW(hspi, BW_250);		// BW = 250 KHz
					break;

		// mode 3 (worst reach, less time on air)
		case 3: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_10);		// SF = 10
					setBW(hspi, BW_125);		// BW = 125 KHz
					break;

