KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
		// mode 4 (better reach, low time on air)
		case 4: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_12);		// SF = 12
					setBW(hspi, BW_500);		// BW = 500 KHz
					break;

		// mode 5 (better reach, medium time on air)
		case 5: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_10);		// SF = 10
					setBW(hspi, BW_250);		// BW = 250 KHz
					break;

		// mode 6 (better reach, worst time-on-air)
		case 6: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_11);		// SF = 11
					setBW(hspi, BW_500);		// BW = 500 KHz
					break;

		// mode 7 (medium-high reach, medium-low time-on-air)
		case 7: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_9);		// SF = 9
					setBW(hspi, BW_250);		// BW = 250 KHz
					break;

		// mode 8 (medium reach, medium time-on-air)
		case 8:		setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_9);		// SF = 9
					setBW(hspi, BW_500);		// BW = 500 KHz
					break;

		// mode 9 (medium-low reach, medium-high time-on-air)
		case 9: 	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_8);		// SF = 8
					setBW(hspi, BW_500);		// BW = 500 KHz
					break;

		// mode 10 (worst reach, less time_on_air)
		case 10:	setCR(hspi, CR_5);		// CR = 4/5
					setSF(hspi, SF_7);		// SF = 7
					setBW(hspi, BW_500);		// BW = 500 KHz
					break;

		default:	state = -1; // The indicated mode doesn't exist

	};


	// Check proper register configuration
	if( state == -1 )	// if state = -1, don't change its value
	{
	}
	else
	{
		state = 1;
		config1 = readRegister(hspi, REG_MODEM_CONFIG1);
		switch (mode)
		{
			// (config1 >> 4) ---> take out bits 7-4 from REG_MODEM_CONFIG1 (=_bandwidth)
			// ((config1 >> 1) & 0x07) ---> take out bits 3-1 from REG_MODEM_CONFIG1 (=_codingRate)
			// (config2 >> 4) ---> take out bits 7-4 from REG_MODEM_CONFIG2 (=_spreadingFactor)

			// mode 1: BW = 125 KHz, CR = 4/5, SF = 12.
			case 1:
				if( (config1 >> 4) == BW_125 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_12 ) {
						state = 0;
					}
				}
				break;


			// mode 2: BW = 250 KHz, CR = 4/5, SF = 12.
			case 2:
				if( (config1 >> 4) == BW_250 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_12 ) {
						state = 0;
					}
				}
				break;

			// mode 3: BW = 125 KHz, CR = 4/5, SF = 10.
			case 3:
				if( (config1 >> 4) == BW_125 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_10 ) {
						state = 0;
					}
				}
				break;

			// mode 4: BW = 500 KHz, CR = 4/5, SF = 12.
			case 4:
				if( (config1 >> 4) == BW_500 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_12 ) {
						state = 0;
					}
				}
				break;

			// mode 5: BW = 250 KHz, CR = 4/5, SF = 10.
			case 5:
				if( (config1 >> 4) == BW_250 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_10 ) {
						state = 0;
					}
				}
				break;

			// mode 6: BW = 500 KHz, CR = 4/5, SF = 11.
			case 6:
				if( (config1 >> 4) == BW_500 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_11 ) {
						state = 0;
					}
				}
				break;

			// mode 7: BW = 250 KHz, CR = 4/5, SF = 9.
			case 7:
				if( (config1 >> 4) == BW_250 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_9 ) {
						state = 0;
					}
				}
				break;

			// mode 8: BW = 500 KHz, CR = 4/5, SF = 9.
			case 8:
				if( (config1 >> 4) == BW_500 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_9 ) {
						state = 0;
					}
				}
				break;

			// mode 9: BW = 500 KHz, CR = 4/5, SF = 8.
			case 9:
				if( (config1 >> 4) == BW_500 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_8 ) {
						state = 0;
					}
				}
				break;

			// mode 10: BW = 500 KHz, CR = 4/5, SF = 7.
			case 10:
				if( (config1 >> 4) == BW_500 && ((config1 >> 1) & 0x07) == CR_5) {
					config2 = readRegister(hspi, REG_MODEM_CONFIG2);
					if( (config2 >> 4) == SF_7 ) {
						state = 0;
					}
				}
				break;
		}// end switch
	}
	// Getting back to previous status
	writeRegister(hspi, REG_OP_MODE, st0);
	HAL_Delay(100);
	return state;
}
/*
 Function: Sets the signal power indicated in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   p: power option to set in configuration.
*/
int8_t setPower(SPI_HandleTypeDef *hspi, char p)
{
  uint8_t st0;
  int8_t state = 2;
  uint8_t value = 0x00;

  st0 = readRegister(hspi, REG_OP_MODE);	  // Save the previous status
  if( _modem == LORA )
  { // LoRa Stdby mode to write in registers
	  writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);
  }
  else
  { // FSK Stdby mode to write in registers
	  writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);
  }

  writeRegister(hspi, REG_PA_DAC, 0x84);

  switch (p)
  {

    // M = max
    // H = high
    // I = intermediate
    // L = low

    case 'M':  _power = 0xFF; //20dbm
	       writeRegister(hspi, REG_PA_DAC, 0x87);
               break;

    case 'H':  _power = 0xFC; //14dbm
               break;

    case 'I':  _power = 0xF6; //8dbm
               break;

    case 'L':  _power = 0xF0; //2dbm
               break;
    default:   state = -1;
               break;
  }

  writeRegister(hspi, REG_PA_CONFIG, _power);	// Setting output power value
  value = readRegister(hspi, REG_PA_CONFIG);

  if( value == _power )
  {
	  state = 0;
  }
  else
  {
	  state = 1;
  }

