KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
  writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
  return state;
}
/*
 Function: Sets the signal power indicated as input to the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   pow: power option to set in configuration. The input value range is from
   0 to 14 dBm.
*/
int8_t setPowerNum(SPI_HandleTypeDef *hspi, uint8_t pow)
{
  uint8_t st0;
  int8_t state = 2;
  uint8_t value = 0x00;

  st0 = readRegister(hspi, REG_OP_MODE);	  // Save the previous status
  if( _modem == LORA )
  { // LoRa Stdby mode to write in registers
	  writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);
  }
  else
  { // FSK Stdby mode to write in registers
	  writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);
  }

  if ( (pow >= 2) && (pow <= 20) )
  { // Pout= 17-(15-OutputPower) = OutputPower+2
	  if ( pow <= 17 ) {
		writeRegister(hspi, REG_PA_DAC, 0x84);
	  	pow = pow - 2;
	  } else { // Power > 17dbm -> Power = 20dbm
		writeRegister(hspi, REG_PA_DAC, 0x87);
		pow = 15;
	  }
	  _power = pow;
  }
  else
  {
	  state = -1;
  }

  writeRegister(hspi, REG_PA_CONFIG, _power);	// Setting output power value
  value = readRegister(hspi, REG_PA_CONFIG);

  if( value == _power )
  {
	  state = 0;
  }
  else
  {
	  state = 1;
  }

  writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
  return state;
}
/*
 Function: Gets the preamble length from the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getPreambleLength(SPI_HandleTypeDef *hspi)
{
	int8_t state = 2;
	uint8_t p_length;
	state = 1;
	if( _modem == LORA )
  	{ // LORA mode
  		p_length = readRegister(hspi, REG_PREAMBLE_MSB_LORA);
  		// Saving MSB preamble length in LoRa mode
		_preamblelength = (p_length << 8) & 0xFFFF;
		p_length = readRegister(hspi, REG_PREAMBLE_LSB_LORA);
  		// Saving LSB preamble length in LoRa mode
		_preamblelength = _preamblelength + (p_length & 0xFFFF);
	}
	else
	{ // FSK mode
		p_length = readRegister(hspi, REG_PREAMBLE_MSB_FSK);
		// Saving MSB preamble length in FSK mode
		_preamblelength = (p_length << 8) & 0xFFFF;
		p_length = readRegister(hspi, REG_PREAMBLE_LSB_FSK);
		// Saving LSB preamble length in FSK mode
		_preamblelength = _preamblelength + (p_length & 0xFFFF);
	}
	state = 0;
	return state;
}

/*
 Function: Sets the preamble length in the module
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   l: length value to set as preamble length.
*/
uint8_t setPreambleLength(SPI_HandleTypeDef *hspi, uint16_t l)
{
	uint8_t st0;
	uint8_t p_length;
	int8_t state = 2;
	st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status
	state = 1;
	if( _modem == LORA )
  	{ // LoRa mode
  		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_MODE);    // Set Standby mode to write in registers
  		p_length = ((l >> 8) & 0x0FF);
  		// Storing MSB preamble length in LoRa mode
		writeRegister(hspi, REG_PREAMBLE_MSB_LORA, p_length);
		p_length = (l & 0x0FF);
		// Storing LSB preamble length in LoRa mode
		writeRegister(hspi, REG_PREAMBLE_LSB_LORA, p_length);
	}
	else
	{ // FSK mode
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);    // Set Standby mode to write in registers
		p_length = ((l >> 8) & 0x0FF);
  		// Storing MSB preamble length in FSK mode
		writeRegister(hspi, REG_PREAMBLE_MSB_FSK, p_length);
		p_length = (l & 0x0FF);
  		// Storing LSB preamble length in FSK mode
		writeRegister(hspi, REG_PREAMBLE_LSB_FSK, p_length);
	}

	state = 0;
	writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
	return state;
}
/*
 Function: It sets the maximum number of retries.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 -->
*/
uint8_t setRetries(SPI_HandleTypeDef *hspi, uint8_t ret)
{
	int8_t state = 2;
	state = 1;
	if( ret > MAX_RETRIES )
	{
		state = -1;
	}
	else
	{
		_maxRetries = ret;
		state = 0;
	}
	return state;
}
/*
 Function: It sets the timeout according to the configured mode.
 Link: http://www.semtech.com/images/datasheet/sx1278.pdf
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t setTimeout(void)
{
	uint8_t state = 2;
	uint16_t delay;
	state = 1;
	if( _modem == LORA )
	{
		// calculate 'delay'
		delay = ((0.1*_sendTime) + 1);

		float Tpacket = timeOnAir(_payloadlength);

		// calculate final send/receive timeout adding an offset and a random value
		_sendTime = (uint16_t) Tpacket + (rand()%delay) + 1000;
		// update state
		state = 0;
	}
	else
	{
		// update state
		_sendTime = MAX_TIMEOUT;

		// update state
		state = 0;
	}
	return state;
}
/*
 Function: Sets the module ON.
 Returns: Nothing
*/
uint8_t ON(SPI_HandleTypeDef *hspi)
{
	uint8_t state = 2;


	// Powering the module
  HAL_GPIO_WritePin(SX1278_NSS_PORT,SX1278_NSS_PIN,GPIO_PIN_SET);
  HAL_Delay(100);

	// Set Maximum Over Current Protection
	state = setMaxCurrent(hspi, 0x1B);

	if( state == 0 )
	{
		#if (SX1278_debug_mode > 1)
			Serial.println(F("## Setting ON with maximum current supply ##"));
			Serial.println();
		#endif
	}
	else
	{
		return 1;
	}

