KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
	// set LoRa mode
	state = setLORA(hspi);

	return state;
}

/*
 Function: Sets the module OFF.
 Returns: Nothing
*/
void OFF(void)
{
	HAL_GPIO_WritePin(SX1278_NSS_PORT,SX1278_NSS_PIN,GPIO_PIN_RESET);
}
/*
 Function: Gets the bandwidth, coding rate and spreading factor of the LoRa modulation.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getMode(SPI_HandleTypeDef *hspi)
{
	uint8_t st0;
	int8_t state = 2;
	uint8_t value = 0x00;

	// Save the previous status
	st0 = readRegister(hspi, REG_OP_MODE);
	// Setting LoRa mode
	if( _modem == FSK )
	{
		setLORA(hspi);
	}
	value = readRegister(hspi, REG_MODEM_CONFIG1);
	_bandwidth = (value >> 4);   				// Storing 4 MSB from REG_MODEM_CONFIG1 (=_bandwidth)
	_codingRate = (value >> 1) & 0x07;  		// Storing first, second and third bits from
	value = readRegister(hspi, REG_MODEM_CONFIG2);	// REG_MODEM_CONFIG1 (=_codingRate)
	_spreadingFactor = (value >> 4) & 0x0F; 	// Storing 4 MSB from REG_MODEM_CONFIG2 (=_spreadingFactor)
	state = 1;

	if( isBW(_bandwidth) )		// Checking available values for:
	{								//		_bandwidth
		if( isCR(_codingRate) )		//		_codingRate
		{							//		_spreadingFactor
			if( isSF(_spreadingFactor) )
			{
				state = 0;
			}
		}
	}
	writeRegister(hspi, REG_OP_MODE, st0);	// Getting back to previous status
	return state;
}
/*
 Function: Gets the node address in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getNodeAddress(SPI_HandleTypeDef *hspi)
{
	uint8_t st0 = 0;
	uint8_t state = 2;

	if( _modem == LORA )
	{
		// Nothing to read
		// node address is stored in _nodeAddress attribute
		state = 0;
	}
	else
	{
		// FSK mode
		st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status

		// Allowing access to FSK registers while in LoRa standby mode
		writeRegister(hspi, REG_OP_MODE, LORA_STANDBY_FSK_REGS_MODE);

		// Read node address
		_nodeAddress = readRegister(hspi, REG_NODE_ADRS);

		// Getting back to previous status
		writeRegister(hspi, REG_OP_MODE, st0);

		// update state
		state = 0;
	}
	return state;
}
/*
 Function: It gets and stores a packet if it is received before ending 'wait' time.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden parameter value for this function
 Parameters:
   wait: time to wait while there is no a valid header received.
*/
int8_t getPacket(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t state = 2;
	int8_t state_f = 2;
	uint8_t value = 0x00;
	unsigned long previous;
	_Bool p_received = false;

	previous = HAL_GetTick();

	if( _modem == LORA )
	{
		/// LoRa mode
		// read REG_IRQ_FLAGS
		value = readRegister(hspi, REG_IRQ_FLAGS);

		// Wait until the packet is received (RxDone flag) or the timeout expires
		while( (bitRead(value, 6) == 0) && (HAL_GetTick()-previous < (unsigned long)wait) )
		{
			value = readRegister(hspi, REG_IRQ_FLAGS);

			// Condition to avoid an overflow (DO NOT REMOVE)
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}

		// Check if 'RxDone' is true and 'PayloadCrcError' is correct
		if( (bitRead(value, 6) == 1) && (bitRead(value, 5) == 0) )
		{
			// packet received & CRC correct
			p_received = true;	// packet correctly received
			_reception = CORRECT_PACKET;
		}
		else
		{
			if( (bitRead(value, 5) == 0) && (_CRC == CRC_ON) )
			{
				// CRC is correct
				_reception = CORRECT_PACKET;
			}
			else
			{
				// CRC incorrect
				_reception = INCORRECT_PACKET;
				state = 3;
			}
		}

	}
	else
	{
		/// FSK mode
		value = readRegister(hspi, REG_IRQ_FLAGS2);
		while( (bitRead(value, 2) == 0) && (HAL_GetTick() - previous < wait) )
		{
			value = readRegister(hspi, REG_IRQ_FLAGS2);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		} // end while (millis)
		if( bitRead(value, 2) == 1 )
		{ // packet received
 			if( (bitRead(value, 1) == 1) && (_CRC == CRC_ON) )
			{ // CRC correct
				_reception = CORRECT_PACKET;
				p_received = true;
			}
			else
			{ // CRC incorrect
				_reception = INCORRECT_PACKET;
				state = 3;
				p_received = false;
			}
		}
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);	// Setting standby FSK mode
	}

	/* If a new packet was received correctly, now the information must be
	 * filled inside the structures of the class
	 */
	if( p_received == true )
	{
		// Store the packet
		if( _modem == LORA )
		{
			/// LoRa
			// Setting address pointer in FIFO data buffer
			writeRegister(hspi, REG_FIFO_ADDR_PTR, 0x00);
			// Storing first uint8_t of the received packet
			packet_received.dst = readRegister(hspi, REG_FIFO);
		}
		else
		{
			/// FSK
			value = readRegister(hspi, REG_PACKET_CONFIG1);
			if( (bitRead(value, 2) == 0) && (bitRead(value, 1) == 0) )
			{
				// Storing first uint8_t of the received packet
				packet_received.dst = readRegister(hspi, REG_FIFO);
			}
			else
			{
				// Storing first uint8_t of the received packet
				packet_received.dst = _destination;
			}
		}

		// Reading second uint8_t of the received packet
		// Reading third uint8_t of the received packet
		// Reading fourth uint8_t of the received packet
		packet_received.src = readRegister(hspi, REG_FIFO);
		packet_received.packnum = readRegister(hspi, REG_FIFO);
		packet_received.length = readRegister(hspi, REG_FIFO);

		// calculate the payload length
		if( _modem == LORA )
		{
			_payloadlength = packet_received.length - OFFSET_PAYLOADLENGTH;
		}

		// check if length is incorrect
		if( packet_received.length > (MAX_LENGTH + 1) )
		{
			#if (SX1278_debug_mode > 0)
				Serial.println(F("Corrupted packet, length must be less than 256"));
			#endif
		}
		else
		{
			// Store payload in 'data'
			for(unsigned int i = 0; i < _payloadlength; i++)
			{
				packet_received.data[i] = readRegister(hspi, REG_FIFO);
			}
			// Store 'retry'
			packet_received.retry = readRegister(hspi, REG_FIFO);

			// Print the packet if debug_mode
			state_f = 0;
		}
	}
	else
	{
		// if packet was NOT received
		state_f = 1;
		if( (_reception == INCORRECT_PACKET) && (_retries < _maxRetries) && (state != 3) )
		{
			_retries++;
		}
	}

	// Setting address pointer in FIFO data buffer to 0x00 again
	if( _modem == LORA )
	{
		writeRegister(hspi, REG_FIFO_ADDR_PTR, 0x00);
	}

	// Initializing flags
	clearFlags(hspi);

	if( wait > MAX_WAIT )
	{
		state_f = -1;
	}

