KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
	return state_f;
}
/*
 Function: It gets and stores a packet if it is received before MAX_TIMEOUT expires.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getPacketMAXTimeout(SPI_HandleTypeDef *hspi)
{
	return getPacket(hspi, MAX_TIMEOUT);
}
/*
 Function: Gets the payload length from the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getPayloadLength(SPI_HandleTypeDef *hspi)
{
	uint8_t state = 2;

	if( _modem == LORA )
  	{ // LORA mode
  		// Saving payload length in LoRa mode
		_payloadlength = readRegister(hspi, REG_PAYLOAD_LENGTH_LORA);
		state = 1;
	}
	else
	{ // FSK mode
  		// Saving payload length in FSK mode
		_payloadlength = readRegister(hspi, REG_PAYLOAD_LENGTH_FSK);
		state = 1;
	}
	state = 0;
	return state;
}
/*
 Function: Gets the signal power within the module is configured.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getPower(SPI_HandleTypeDef *hspi)
{
  uint8_t state = 2;
  uint8_t value = 0x00;

  value = readRegister(hspi, REG_PA_CONFIG);
  state = 1;

  value = value & 15;
  // Pout= 17-(15-OutputPower) = OutputPower+2
  value = value + 2;

  _power = value;
  if( (value >= 2) && (value <= 20) )
  {
	    state = 0;
  }

  return state;
}
/*
 Function: It gets the temperature from the measurement block module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getTemp(SPI_HandleTypeDef *hspi)
{
	uint8_t st0;
	uint8_t state = 2;
	st0 = readRegister(hspi, REG_OP_MODE);	// Save the previous status

	if( _modem == LORA )
	{ // Allowing access to FSK registers while in LoRa standby mode
		writeRegister(hspi,REG_OP_MODE, LORA_STANDBY_FSK_REGS_MODE);
	}

	state = 1;
	// Saving temperature value
	_temp = readRegister(hspi,REG_TEMP);
	if( _temp & 0x80 ) // The SNR sign bit is 1
	{
		// Invert and divide by 4
		_temp = ( ( ~_temp + 1 ) & 0xFF );
    }
    else
    {
		// Divide by 4
		_temp = ( _temp & 0xFF );
	}
	if( _modem == LORA )
	{
		writeRegister(hspi,REG_OP_MODE, st0);	// Getting back to previous status
	}

	state = 0;
	return state;
}
/*
 Function: Gets the content of different registers.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getRegs(SPI_HandleTypeDef *hspi)
{
	int8_t state = 2;
	uint8_t state_f = 2;


	state_f = 1;
	state = getMode(hspi);			// Stores the BW, CR and SF.
	if( state == 0 )
	{
		state = getPower(hspi);		// Stores the power.
	}
	else
	{
		state_f = 1;
	}
 	if( state == 0 )
	{
		state = getChannel(hspi);	// Stores the channel.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state = getCRC(hspi);		// Stores the CRC configuration.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state = getHeader();	// Stores the header configuration.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state = getPreambleLength(hspi);	// Stores the preamble length.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state = getPayloadLength(hspi);		// Stores the payload length.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state = getNodeAddress(hspi);		// Stores the node address.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state = getMaxCurrent(hspi);		// Stores the maximum current supply.
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		state_f = getTemp(hspi);		// Stores the module temperature.
	}
	else
	{
		state_f = 1;
	}
	return state_f;
}
/*
 Function: Gets the current value of RSSI.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t getRSSI(SPI_HandleTypeDef *hspi)
{
	uint8_t state = 2;
	int rssi_mean = 0;
	int total = 5;

	if( _modem == LORA )
	{
		/// LoRa mode
		// get mean value of RSSI
		for(int i = 0; i < total; i++)
		{
			_RSSI = -OFFSET_RSSI + readRegister(hspi, REG_RSSI_VALUE_LORA);
			rssi_mean += _RSSI;
		}
		rssi_mean = rssi_mean / total;
		_RSSI = rssi_mean;

		state = 0;
	}
	else
	{
		/// FSK mode
		// get mean value of RSSI
		for(int i = 0; i < total; i++)
		{
			_RSSI = (readRegister(hspi, REG_RSSI_VALUE_FSK) >> 1);
			rssi_mean += _RSSI;
		}
		rssi_mean = rssi_mean / total;
		_RSSI = rssi_mean;

		state = 0;
	}
	return state;
}
/*
 Function: Gets the SNR value in LoRa mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t getSNR(SPI_HandleTypeDef *hspi)
{	// getSNR exists only in LoRa mode
  int8_t state = 2;
  uint8_t value;
  if( _modem == LORA )
  { // LoRa mode
	  state = 1;
	  value = readRegister(hspi, REG_PKT_SNR_VALUE);
	  if( value & 0x80 ) // The SNR sign bit is 1
	  {
		  // Invert and divide by 4
		  value = ( ( ~value + 1 ) & 0xFF ) >> 2;
          _SNR = -value;
      }
      else
      {
		  // Divide by 4
		  _SNR = ( value & 0xFF ) >> 2;
	  }
	  state = 0;
  }
  else
  { // forbidden command if FSK mode
	state = -1;
  }
  return state;
}

