KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
/*
 Function: Gets the RSSI of the last packet received in LoRa mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int16_t getRSSIpacket(SPI_HandleTypeDef *hspi)
{	// RSSIpacket only exists in LoRa
  int8_t state = 2;
  state = 1;
  if( _modem == LORA )
  { // LoRa mode
	  state = getSNR(hspi);
	  if( state == 0 )
	  {
		  if( _SNR < 0 )
		  {
			  _RSSIpacket = -NOISE_ABSOLUTE_ZERO + 10.0 * SignalBwLog[_bandwidth] + NOISE_FIGURE + ( double )_SNR;
			  state = 0;
		  }
		  else
		  {
			  _RSSIpacket = readRegister(hspi, REG_PKT_RSSI_VALUE);
			  _RSSIpacket = -OFFSET_RSSI + ( double )_RSSIpacket;
			  state = 0;
		  }
	  }
  }
  else
  { // RSSI packet doesn't exist in FSK mode
	state = -1;
  }
  return state;
}
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendWithTimeout(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t state = 2;
	uint8_t value = 0x00;
	unsigned long previous;

	// wait to TxDone flag
	previous = HAL_GetTick();
	if( _modem == LORA )
	{
		/// LoRa mode
		// Initializing flags
		clearFlags(hspi);
		// LORA mode - Tx
		writeRegister(hspi, REG_OP_MODE, LORA_TX_MODE);

		value = readRegister(hspi, REG_IRQ_FLAGS);

		// Wait until the packet is sent (TX Done flag) or the timeout expires
		while ((bitRead(value, 3) == 0) && (HAL_GetTick() - previous < wait))
		{
			value = readRegister(hspi, REG_IRQ_FLAGS);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}
		state = 1;
	}
	else
	{
		/// FSK mode
		writeRegister(hspi, REG_OP_MODE, FSK_TX_MODE);  // FSK mode - Tx

		value = readRegister(hspi, REG_IRQ_FLAGS2);
		// Wait until the packet is sent (Packet Sent flag) or the timeout expires
		while ((bitRead(value, 3) == 0) && (HAL_GetTick() - previous < wait))
		{
			value = readRegister(hspi, REG_IRQ_FLAGS2);

			// Condition to avoid an overflow (DO NOT REMOVE)
			if( HAL_GetTick() < previous )
			{
				previous = HAL_GetTick();
			}
		}
		state = 1;
	}
	if( bitRead(value, 3) == 1 )
	{
		state = 0;	// Packet successfully sent
	}

	// Initializing flags
	clearFlags(hspi);
	return state;
}
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendWithTimeout_sendtime(SPI_HandleTypeDef *hspi)
{
	setTimeout();
	return sendWithTimeout(hspi, _sendTime);
}
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeout_sendtime(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload)
{
	uint8_t state = 2;
	state = setPacket(hspi,dest, payload);	// Setting a packet with 'dest' destination
	if (state == 0)								// and writing it in FIFO.
	{
		state = sendWithTimeout_sendtime(hspi);	// Sending the packet
	}
	return state;
}
/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receive(SPI_HandleTypeDef *hspi)
{
	uint8_t state = 1;
	// Initializing packet_received struct
	memset( &packet_received, 0x00, sizeof(packet_received) );

	// Setting Testmode
	writeRegister(hspi, 0x31,0x43);
	// Set LowPnTxPllOff
	writeRegister(hspi, REG_PA_RAMP, 0x09);
	// Set LNA gain: Highest gain. LnaBoost:Improved sensitivity
	writeRegister(hspi, REG_LNA, 0x23);
	// Setting address pointer in FIFO data buffer
	writeRegister(hspi, REG_FIFO_ADDR_PTR, 0x00);
	// change RegSymbTimeoutLsb
	writeRegister(hspi, REG_SYMB_TIMEOUT_LSB, 0xFF);
	// Setting current value of reception buffer pointer
	writeRegister(hspi, REG_FIFO_RX_BYTE_ADDR, 0x00);

	// Proceed depending on the protocol selected
	if( _modem == LORA )
	{
		/// LoRa mode
		// With MAX_LENGTH gets all packets with length < MAX_LENGTH
		state = setPacketLength(hspi, MAX_LENGTH);
		// Set LORA mode - Rx
		writeRegister(hspi, REG_OP_MODE, LORA_RX_MODE);
	}
	else
	{
		/// FSK mode
		state = setPacketLength_payloadlength(hspi);
		// FSK mode - Rx
		writeRegister(hspi, REG_OP_MODE, FSK_RX_MODE);
	}
	return state;
}
/*
 Function: Configures the module to receive all the information on air.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receiveAll(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t state = 2;
	uint8_t config1;
	if( _modem == FSK )
	{
		/// FSK mode
		writeRegister(hspi, REG_OP_MODE, FSK_STANDBY_MODE);		// Setting standby FSK mode
		config1 = readRegister(hspi, REG_PACKET_CONFIG1);
		config1 = config1 & 249;			// clears bits 2-1 from REG_PACKET_CONFIG1
		writeRegister(hspi, REG_PACKET_CONFIG1, config1);		// AddressFiltering = None
	}
	// Setting Rx mode
	state = receive(hspi);

	if( state == 0 )
	{
		// Getting all packets received in wait
		state = getPacket(hspi, wait);
	}
	return state;
}
/*
 Function: Configures the module to receive all the information on air, before MAX_TIMEOUT expires.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	receiveAll_MAX_TIMEOUT(SPI_HandleTypeDef *hspi)
{
	return receiveAll(hspi, MAX_TIMEOUT);
}
/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receivePacketTimeout(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t state = 2;
	uint8_t state_f = 2;
	// set RX mode
	state = receive(hspi);

	// if RX mode is set correctly then wait for data
	if( state == 0 )
	{
		// Wait for a new packet for 'wait' time
		if( availableData(hspi, wait) )
		{
			// If packet received, getPacket
			state_f = getPacket(hspi,MAX_TIMEOUT);
		}
		else
		{
			state_f = 1;
		}
	}
	else
	{
		state_f = state;
	}
	return state_f;
}
/*
 Function: Configures the module to receive information and send an ACK.
 Returns: Integer that determines if there has been any error
   state = 4  --> The command has been executed but the packet received is incorrect
   state = 3  --> The command has been executed but there is no packet received
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receivePacketTimeoutACK(SPI_HandleTypeDef *hspi, uint32_t wait)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	// set RX mode
	state = receive(hspi);

	// if RX mode is set correctly then wait for data
	if( state == 0 )
	{
		// Wait for a new packet for 'wait' time
		if( availableData(hspi, wait) )
		{
			// If packet received, getPacket
			state = getPacketMAXTimeout(hspi);
		}
		else
		{
			state = 1;
			state_f = 3;  // There is no packet received
		}
	}
	else
	{
		state = 1;
		state_f = 1; // There has been an error with the 'receive' function
	}


	if( (state == 0) || (state == 3) )
	{
		if( _reception == INCORRECT_PACKET )
		{
			state_f = 4;  // The packet has been incorrectly received
		}
		else
		{
			state_f = 1;  // The packet has been correctly received
		}
		state = setACK(hspi);
		if( state == 0 )
		{
			state = sendWithTimeout_sendtime(hspi);
			if( state == 0 )
			{
			state_f = 0;
			}
			else
			{
				state_f = 1; // There has been an error with the 'sendWithTimeout' function
			}
		}
		else
		{
			state_f = 1; // There has been an error with the 'setACK' function
		}
	}
	else
	{
		state_f = 1;
	}
	return state_f;
}
/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receivePacketTimeout_sendTime(SPI_HandleTypeDef *hspi)
{
	setTimeout();
	return receivePacketTimeout(hspi, _sendTime);
}
/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receivePacketMAXTimeout(SPI_HandleTypeDef *hspi)
{
	return receivePacketTimeout(hspi, MAX_TIMEOUT);
}
/*
 Function: Configures the module to receive information and send an ACK.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receivePacketMAXTimeoutACK(SPI_HandleTypeDef *hspi)
{
	return receivePacketTimeoutACK(hspi, MAX_TIMEOUT);
}
/*
 Function: Configures the module to receive information and send an ACK.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t receivePacketTimeoutACK_sendTime(SPI_HandleTypeDef *hspi)
{
	setTimeout();
	return receivePacketTimeoutACK(hspi, _sendTime);
}

