KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.c
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeout_WaitTime(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload, uint16_t wait)
{
	uint8_t state = 2;

	state = setPacket(hspi, dest, payload);	// Setting a packet with 'dest' destination
	if (state == 0)								// and writing it in FIFO.
	{
		state = sendWithTimeout(hspi, wait);	// Sending the packet
	}
	return state;
}
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeout_length(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload, uint16_t length16)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	state = truncPayload(length16);
	if( state == 0 )
	{
		state_f = setPacket(hspi, dest, payload);	// Setting a packet with 'dest' destination
	}												// and writing it in FIFO.
	else
	{
		state_f = state;
	}
	if( state_f == 0 )
	{
		state_f = sendWithTimeout_sendtime(hspi);	// Sending the packet
	}
	return state_f;
}
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeout_wait_length(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload, uint16_t length16, uint16_t wait)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	state = truncPayload(length16);
	if( state == 0 )
	{
		state_f = setPacket(hspi, dest, payload);	// Setting a packet with 'dest' destination
	}
	else
	{
		state_f = state;
	}
	if( state_f == 0 )								// and writing it in FIFO.
	{
		state_f = sendWithTimeout(hspi, wait);	// Sending the packet
	}
	return state_f;
}
/*
 Function: Configures the module to transmit information and receive an ACK.
 Returns: Integer that determines if there has been any error
   state = 9  --> The ACK lost (no data available)
   state = 8  --> The ACK lost
   state = 7  --> The ACK destination incorrectly received
   state = 6  --> The ACK source incorrectly received
   state = 5  --> The ACK number incorrectly received
   state = 4  --> The ACK length incorrectly received
   state = 3  --> N-ACK received
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeoutACK(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	state = sendPacketTimeout_sendtime(hspi, dest, payload);	// Sending packet to 'dest' destination
	if( state == 0 )
	{
		state = receive(hspi);	// Setting Rx mode to wait an ACK
	}
	else
	{
		state_f = state;
	}
	if( state == 0 )
	{
		if( availableData_MAX_TIMEOUT(hspi) )
		{
			state_f = getACK_MAX_TIMEOUT(hspi);	// Getting ACK
		}
		else
		{
			state_f = 9;
		}
	}
	else
	{
		state_f = state;
	}

	return state_f;
}
/*
 Function: Configures the module to transmit information and receive an ACK.
 Returns: Integer that determines if there has been any error
   state = 9  --> The ACK lost (no data available)
   state = 8  --> The ACK lost
   state = 7  --> The ACK destination incorrectly received
   state = 6  --> The ACK source incorrectly received
   state = 5  --> The ACK number incorrectly received
   state = 4  --> The ACK length incorrectly received
   state = 3  --> N-ACK received
   state = 2  --> The ACK has not been received
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeoutACK_length(SPI_HandleTypeDef *hspi,	uint8_t dest,
											char *payload,
											uint16_t length16)
{
	uint8_t state = 2;
	uint8_t state_f = 2;


	// Sending packet to 'dest' destination
	state = sendPacketTimeout_length(hspi, dest, payload, length16);

	// Trying to receive the ACK
	if( state == 0 )
	{
		state = receive(hspi);	// Setting Rx mode to wait an ACK
	}
	else
	{
		state_f = state;
	}
	if( state == 0 )
	{
		if( availableData_MAX_TIMEOUT(hspi) )
		{
			state_f = getACK_MAX_TIMEOUT(hspi);	// Getting ACK
		}
		else
		{
			state_f = 9;
		}
	}
	else
	{
		state_f = state;
	}

	return state_f;
}

/*
 Function: Configures the module to transmit information and receive an ACK.
 Returns: Integer that determines if there has been any error
   state = 9  --> The ACK lost (no data available)
   state = 8  --> The ACK lost
   state = 7  --> The ACK destination incorrectly received
   state = 6  --> The ACK source incorrectly received
   state = 5  --> The ACK number incorrectly received
   state = 4  --> The ACK length incorrectly received
   state = 3  --> N-ACK received
   state = 2  --> The ACK has not been received
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t sendPacketTimeoutACK_wait(SPI_HandleTypeDef *hspi,
											uint8_t dest,
											char *payload,
											uint16_t wait)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	state = sendPacketTimeout_WaitTime(hspi, dest, payload, wait);	// Sending packet to 'dest' destination
	if( state == 0 )
	{
		state = receive(hspi);	// Setting Rx mode to wait an ACK
	}
	else
	{
		state_f = 1;
	}
	if( state == 0 )
	{
		if( availableData_MAX_TIMEOUT(hspi) )
		{
			state_f = getACK_MAX_TIMEOUT(hspi);	// Getting ACK
		}
		else
		{
			state_f = 9;
		}
	}
	else
	{
		state_f = 1;
	}

